# -*- coding: utf-8 -*-
"""
Задание 6.3

Список data содержит разные данные.
data = ["a", "100", "30", 10.5, 20, "test", "15", 100]

Надо отобрать из них только те, которые получится преобразовать с помощью int.
Написать код, которые отбирает те элементы из списка data, которые можно
преобразовать в тип integer с помощью int, делает это преобразование и
добавляет элементы в новый список result.
В итоге должен получиться такой список:
[100, 30, 10, 20, 15, 100]

Полученный список result вывести на стандартный поток вывода (stdout) с помощью print.

Список data нельзя менять вручную, все изменения надо сделать с помощью Python.
"""

data = ["a", "100", "30", 10.5, 20, "test", "15", 100]
