# -*- coding: utf-8 -*-
"""
Задание 4.5

Из строк command1 и command2 получить список VLANов, которые есть
и в команде command1 и в команде command2 (пересечение). Элементы
списка должны быть отсортированы по возрастанию.

В данном случае, результатом должен быть такой список: ['1', '3', '8']

Записать итоговый список в переменную result (именно эта переменная будет
проверяться в тесте).
В списке result вланы должны быть отсортированы по возрастанию номеров.
Для получения итогового списка нельзя удалять конкретные vlanы вручную.

Полученный список result вывести на стандартный поток вывода (stdout) с помощью print.

Это задание можно выполнить не используя циклы и условия.

Предупреждение: в разделе 4 тесты можно легко "обмануть" сделав нужный вывод,
без получения результатов из исходных данных с помощью Python.
Это не значит, что задание сделано правильно, просто на данном этапе сложно иначе
проверять результат.
"""

command1 = "switchport trunk allowed vlan 1,2,3,5,8"
command2 = "switchport trunk allowed vlan 1,3,8,9"
